name: "retriever_tokenizer"
backend: "python"
max_batch_size: 64
input [
  {
    name: "QUERY_STRING"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]
output [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ -1, -1 ] 
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ -1, -1 ]
  }
]